# Pandas

In [1]:
import pandas as pd
import numpy as np

## Creation of dataframes
### Creating DataFrames from a NumPy array

In [2]:
df=pd.DataFrame(np.random.randn(2,3), columns=["First", "Second", "Third"], index=["a", "b"])
df

      First    Second     Third
a -0.349441  0.742430 -1.625606
b -1.510291 -2.841044 -0.559524

In [3]:
## asign columns and rows with the Index object
df.index                            # These are the "row names"

Index(['a', 'b'], dtype='object')

In [4]:
df.columns                          # These are the "column names"

Index(['First', 'Second', 'Third'], dtype='object')

In [5]:
# columns or index argument is left out, when an implicit integer index is used:
df2=pd.DataFrame(np.random.randn(2,3), index=["a", "b"])
df2

          0         1         2
a -0.744415 -3.110915 -0.722941
b -0.096330 -0.308629 -0.419322

In [6]:
## the column index is ab object as the range type:
df2.columns

RangeIndex(start=0, stop=3, step=1)

### Create Dataframe from columns

In [7]:
## columns can be specified as a list, an array, or a Series. column names are given with the `columns` parameter -- for series, the `name`attribute
s1 = pd.Series([1,2,3])
s1

0    1
1    2
2    3
dtype: int64

In [8]:
s2 = pd.Series([4,5,6], name="b")
s2

0    4
1    5
2    6
Name: b, dtype: int64

In [9]:
## give the column name explicitly:
pd.DataFrame(s1, columns=["a"])

   a
0  1
1  2
2  3

In [10]:
## using the name of a series: 
pd.DataFrame(s2)

   b
0  4
1  5
2  6

### Creating dataframes from rows

In [11]:
df=pd.DataFrame([{"Wage" : 1000, "Name" : "Jack", "Age" : 21}, {"Wage" : 1500, "Name" : "John", "Age" : 29}])
df

   Wage  Name  Age
0  1000  Jack   21
1  1500  John   29

In [12]:
df = pd.DataFrame([[1000, "Jack", 21], [1500, "John", 29]], columns=["Wage", "Name", "Age"])
df

   Wage  Name  Age
0  1000  Jack   21
1  1500  John   29